In [6]:
import pandas as pd

In [2]:
datos = {'nombre': ['Pedro', 'Juan', 'Lorena'], 
         'edad': [25,39,33]}

datos

{'nombre': ['Pedro', 'Juan', 'Lorena'], 'edad': [25, 39, 33]}

In [7]:
df = pd.DataFrame(datos)
df

   nombre  edad
0   Pedro    25
1    Juan    39
2  Lorena    33

In [10]:
type(df)

pandas.core.frame.DataFrame

In [11]:
df['nombre']

0     Pedro
1      Juan
2    Lorena
Name: nombre, dtype: object

In [12]:
df.nombre

0     Pedro
1      Juan
2    Lorena
Name: nombre, dtype: object

In [13]:
type(df.nombre)

pandas.core.series.Series

In [14]:
import pandas as pd

datos = {'nombre': ['Ana', 'Luis', 'Carlos'],
                'edad': [30,25,40]}
                
df_empleados = pd.DataFrame(datos)

print(df_empleados)

   nombre  edad
0     Ana    30
1    Luis    25
2  Carlos    40

In [18]:
edades = pd.Series(datos['edad'])

print(type(edades))

print(edades)

<class 'pandas.core.series.Series'>
0    30
1    25
2    40
dtype: int64

In [21]:
print(df_empleados.shape)
print(df_empleados.columns)
print(df_empleados.index)

(3, 2)
Index(['nombre', 'edad'], dtype='object')
RangeIndex(start=0, stop=3, step=1)